[
  {
    "act_id": "101",
    "title": "The Mussalman Wakf Validating Act, 1913",
    "year": "1913",
    "section_count": 5,
    "summary": "The Mussalman Wakf Validating Act, 1913, establishes the legal framework for Muslims in Bangladesh to create wakfs, which are charitable endowments, primarily for family maintenance and support during their lifetime, while ultimately benefiting the poor or charitable causes. It clarifies that wakfs cannot be deemed invalid due to delays in benefiting the poor and preserves local customs among different Muslim sects. This Act applies specifically to individuals of the Muslim faith, particularly Hanafi Mussalmans."
  },
  {
    "act_id": "105",
    "title": "The Hindu Disposition of Property Act, 1916",
    "year": "1916",
    "section_count": 5,
    "summary": "The Hindu Disposition of Property Act, 1916 governs the transfer of property by Hindus in Bangladesh, allowing for valid property dispositions even for beneficiaries who are not yet born. It outlines specific limitations and conditions for such transfers, referencing relevant laws from the Transfer of Property Act and the Succession Act. Additionally, the Act can be extended to the Khoja community if they request it, ensuring its applicability to a broader group within the Hindu population."
  },
  {
    "act_id": "1063",
    "title": "পারিবারিক সহিংসতা (প্রতিরোধ ও সুরক্ষা) আইন, ২০১০",
    "year": "২০১০",
    "section_count": 37,
    "summary": "The Domestic Violence (Prevention and Protection) Act, 2010 aims to prevent and address domestic violence in Bangladesh by providing legal protections and support for individuals affected by family violence. It covers various forms of abuse, establishes the roles and responsibilities of police and enforcement officers, and outlines procedures for obtaining protection and compensation. The act applies to all individuals in domestic relationships, ensuring their rights to safety and support within their homes."
  },
  {
    "act_id": "1105",
    "title": "হিন্দু বিবাহ নিবন্ধন আইন, ২০১২",
    "year": "২০১২",
    "section_count": 15,
    "summary": "The Hindu Marriage Registration Act, 2012 establishes a framework for the registration of Hindu marriages in Bangladesh, ensuring that such marriages are documented while maintaining their validity regardless of registration. It outlines the procedures for registration, the qualifications and responsibilities of marriage registrars, and the fees associated with the process. This law applies specifically to all Hindu residents in Bangladesh, aiming to provide legal recognition and protection for Hindu marriages."
  },
  {
    "act_id": "1109",
    "title": "ওয়াক্‌ফ (সম্পত্তি হস্তান্তর ও উন্নয়ন) বিশেষ বিধান আইন, ২০১৩",
    "year": "২০১৩",
    "section_count": 26,
    "summary": "The Waqf (Property Transfer and Development) Special Provisions Act, 2013, establishes a legal framework for the transfer and development of waqf properties in Bangladesh, ensuring that such transactions benefit the waqf and its beneficiaries. It outlines the procedures for property transfer, the role of waqf administrators, and the establishment of a special committee to oversee transfers, while also detailing restrictions, funding methods, and penalties for violations. This act applies to all waqf properties and their management, aiming to protect the interests of the waqf and its beneficiaries."
  },
  {
    "act_id": "1119",
    "title": "শিশু আইন, ২০১৩",
    "year": "২০১৩",
    "section_count": 101,
    "summary": "The Children Act, 2013, aims to protect the rights and welfare of children under 18 years in Bangladesh, particularly those in conflict with the law. It establishes a comprehensive framework for the appointment of probation officers, the creation of child welfare boards at national, district, and upazila levels, and the establishment of specialized juvenile courts to handle cases involving children. The act emphasizes the importance of child-friendly procedures and environments in legal processes, ensuring that children's needs and rights are prioritized throughout the judicial system."
  },
  {
    "act_id": "1132",
    "title": "পিতা-মাতার ভরণ-পোষণ আইন, ২০১৩",
    "year": "২০১৩",
    "section_count": 9,
    "summary": "The Parent's Maintenance Act, 2013 establishes the legal obligation of children to provide maintenance and support to their parents, including provisions for grandparents in their absence. It outlines the responsibilities of children, penalties for non-compliance, and the legal processes for addressing disputes related to parental maintenance. This law applies to all children and their parents, ensuring that familial support is upheld within Bangladesh."
  },
  {
    "act_id": "1172",
    "title": "গণকর্মচারী (বিদেশি নাগরিকের সহিত বিবাহ) আইন, ২০১৫",
    "year": "২০১৫",
    "section_count": 4,
    "summary": "The Gonokormochari (Bideshi Nagoriker Sohit Bibah) Ain, 2015 regulates the marriages of government employees in Bangladesh with foreign nationals. It requires public servants to obtain prior approval from the President before marrying a foreign citizen and outlines the penalties for non-compliance. This law also repeals an earlier ordinance while ensuring that previous actions taken under that ordinance remain valid."
  },
  {
    "act_id": "1207",
    "title": "বাল্যবিবাহ নিরোধ আইন, ২০১৭",
    "year": "২০১৭",
    "section_count": 22,
    "summary": "The Child Marriage Restraint Act, 2017 aims to prevent child marriage in Bangladesh by establishing strict penalties for those who engage in or facilitate such marriages, including parents and marriage registrars. The law outlines the formation of committees to combat child marriage, defines key terms, and provides mechanisms for reporting and investigating offenses. It applies to all individuals involved in child marriage, including minors, adults, parents, and local officials, and emphasizes the importance of protecting minors from early marriage."
  },
  {
    "act_id": "122",
    "title": "The Maintenance Orders Enforcement Act, 1921",
    "year": "1921",
    "section_count": 12,
    "summary": "The Maintenance Orders Enforcement Act, 1921 establishes a legal framework for enforcing maintenance orders in Bangladesh, particularly concerning individuals residing in other countries that have reciprocal agreements with Bangladesh. It outlines procedures for registering, transmitting, and enforcing maintenance orders, as well as the responsibilities of courts and the government in these processes. The Act applies to dependants seeking maintenance from individuals living in reciprocating territories, ensuring that such orders are recognized and enforced effectively across borders."
  },
  {
    "act_id": "1256",
    "title": "যৌতুক নিরোধ আইন, ২০১৮",
    "year": "২০১৮",
    "section_count": 11,
    "summary": "The Dowry Prohibition Act, 2018 aims to eliminate the practice of dowry in Bangladesh by making it illegal to demand, give, or receive dowry during marriage. It establishes penalties for those involved in dowry transactions and declares any related agreements void. The law applies to all parties involved in a marriage and emphasizes the seriousness of dowry-related offenses, ensuring that such crimes are not bailable and cannot be compromised."
  },
  {
    "act_id": "1351",
    "title": "নারী ও শিশু নির্যাতন দমন (সংশোধন) আইন, ২০২০",
    "year": "২০২০",
    "section_count": 8,
    "summary": "The Women and Children Repression Prevention (Amendment) Act, 2020 updates and amends various provisions of the original 2000 Act to enhance protections for women and children against violence and exploitation. Key changes include clarifications on offenses, the introduction of mandatory DNA testing in related crimes, and updates to references in existing laws. This act applies to all individuals involved in cases of violence against women and children, ensuring that legal proceedings are more comprehensive and victim-focused."
  },
  {
    "act_id": "1375",
    "title": "শিশু দিবাযত্ন কেন্দ্র আইন, ২০২১",
    "year": "২০২১",
    "section_count": 34,
    "summary": "The Child Daycare Center Act, 2021 establishes a legal framework for the registration, management, and operation of child daycare centers in Bangladesh. It outlines the requirements for setting up these centers, including registration processes, operational standards, and the rights and responsibilities of guardians and center operators. The act applies to all institutions intending to operate daycare centers, ensuring compliance with safety, financial, and administrative regulations to protect the welfare of children."
  },
  {
    "act_id": "138",
    "title": "The Succession Act, 1925",
    "year": "1925",
    "section_count": 395,
    "summary": "The Succession Act, 1925 governs the distribution of a deceased person's property in Bangladesh, outlining how both moveable and immoveable assets are inherited based on the individual's domicile at the time of death. It addresses key topics such as the determination of domicile for individuals, the impact of marriage on property rights, and the applicability of the Act to various religious groups. The Act primarily applies to individuals who are not Hindus, Muslims, Buddhists, Sikhs, or Jains, as these groups are subject to their own personal laws regarding succession."
  },
  {
    "act_id": "1444",
    "title": "পারিবারিক আদালত আইন, ২০২৩",
    "year": "২০২৩",
    "section_count": 31,
    "summary": "The Family Court Act, 2023 establishes a framework for family courts across Bangladesh to handle matters related to Muslim family law, including divorce, maintenance, and child custody. It outlines procedures for filing cases, conducting hearings, and resolving disputes, while ensuring that the courts prioritize reconciliation between parties. This act applies to all individuals seeking legal resolution for family-related issues, providing a structured and accessible legal process."
  },
  {
    "act_id": "147",
    "title": "The Hindu Inheritance (Removal of Disabilities) Act, 1928",
    "year": "1928",
    "section_count": 3,
    "summary": "The Hindu Inheritance (Removal of Disabilities) Act, 1928 aims to ensure that individuals governed by Hindu Law cannot be excluded from inheriting property or rights in joint-family property due to physical or mental disabilities, with the exception of those who are lunatics or idiots from birth. The Act does not apply to individuals under the Dayabhaga School of Hindu Law and preserves existing rights and liabilities prior to its enactment, without creating new rights related to religious offices or trusts."
  },
  {
    "act_id": "148",
    "title": "The Hindu Law of Inheritance (Amendment) Act, 1929",
    "year": "1929",
    "section_count": 3,
    "summary": "The Hindu Law of Inheritance (Amendment) Act, 1929, amends the rules of inheritance under the Mitakshara law for Hindus, specifically addressing property not held in coparcenary. It establishes a clear order of succession for certain heirs, including daughters and sisters, while also preserving existing customs related to inheritance rights, especially for female heirs. This Act applies to Hindus in Bangladesh, clarifying their rights to inherit property."
  },
  {
    "act_id": "1488",
    "title": "গ্রাম আদালত (সংশোধন) আইন, ২০২৪",
    "year": "২০২৪",
    "section_count": 10,
    "summary": "The Village Court (Amendment) Act, 2024, amends the Village Court Act of 2006 to update definitions, adjust monetary thresholds, and refine procedures for village courts in Bangladesh. Key changes include new provisions for decision-making in case of tie votes, the inclusion of legal heirs in ongoing disputes, and modifications to the composition and formation of village courts. This act applies to local authorities and individuals involved in civil and criminal disputes within the village court system."
  },
  {
    "act_id": "149",
    "title": "The Child Marriage Restraint Act, 1929",
    "year": "1929",
    "section_count": 12,
    "summary": "The Child Marriage Restraint Act, 1929 aims to prevent child marriages in Bangladesh by establishing legal consequences for adults who marry or facilitate the marriage of minors. It defines key terms related to child marriage and outlines punishments for those involved, including parents and guardians. The Act applies to all citizens of Bangladesh and includes provisions for jurisdiction, inquiries, and the issuance of injunctions to stop unlawful marriages."
  },
  {
    "act_id": "152",
    "title": "The Hindu Gains of Learning Act, 1930",
    "year": "1930",
    "section_count": 4,
    "summary": "The Hindu Gains of Learning Act, 1930, applies to the whole of Bangladesh and establishes that any educational or professional achievements (referred to as \"gains of learning\") are considered the exclusive property of the individual who acquired them. This means that such gains cannot be claimed as joint or shared property due to familial or financial circumstances. Additionally, the Act does not affect any property rights or legal proceedings that existed before it came into force."
  },
  {
    "act_id": "1524",
    "title": "নারী ও শিশু নির্যাতন দমন (সংশোধন) অধ্যাদেশ, ২০২৫",
    "year": "২০২৫",
    "section_count": 26,
    "summary": "The Women and Children Repression Prevention (Amendment) Ordinance, 2025, aims to strengthen legal protections against violence and abuse towards women and children in Bangladesh. It introduces new definitions of offenses, enhances penalties for crimes such as rape, and establishes specialized Child Rape Prevention Tribunals to expedite justice. The ordinance applies to all individuals involved in cases of violence against women and children, ensuring better support for victims and stricter accountability for offenders."
  },
  {
    "act_id": "1543",
    "title": "জুলাই গণঅভ্যুত্থানে শহিদ পরিবার এবং জুলাই যোদ্ধাদের কল্যাণ ও পুনর্বাসন অধ্যাদেশ, ২০২৫",
    "year": "২০২৫",
    "section_count": 25,
    "summary": "The \"July People's Uprising Martyrs' Family and July Warriors' Welfare and Rehabilitation Ordinance, 2025\" aims to support and rehabilitate the families of martyrs and injured participants of the July Mass Uprising. It establishes a dedicated department to provide financial assistance, medical care, and preserve the history of the uprising, while also outlining penalties for fraudulent claims. This ordinance applies to the families of those recognized as martyrs and injured warriors from the uprising, ensuring their welfare and recognition."
  },
  {
    "act_id": "168",
    "title": "The Parsi Marriage and Divorce Act, 1936",
    "year": "1936",
    "section_count": 53,
    "summary": "The Parsi Marriage and Divorce Act, 1936 governs the marriage and divorce practices specifically for the Parsi community in Bangladesh. It outlines the requirements for valid Parsi marriages, prohibits bigamy, and establishes procedures for marriage registration and divorce decrees. The Act applies to all Parsis in Bangladesh, ensuring legal recognition and regulation of their marital relationships."
  },
  {
    "act_id": "171",
    "title": "The Hindu Women's Rights to Property Act, 1937",
    "year": "1937",
    "section_count": 5,
    "summary": "The Hindu Women's Rights to Property Act, 1937 aims to secure the property rights of Hindu widows in Bangladesh when their husbands die without a will (intestate). It establishes that widows have specific inheritance rights, overriding any conflicting Hindu laws or customs. The Act applies to all Hindus in Bangladesh who die intestate after its enactment, ensuring that their widows are recognized as rightful heirs to their property."
  },
  {
    "act_id": "172",
    "title": "The Arya Marriage Validation Act, 1937",
    "year": "1937",
    "section_count": 2,
    "summary": "The Arya Marriage Validation Act, 1937, establishes that marriages between members of the Arya Samaj are legally valid in Bangladesh, regardless of caste or prior religious affiliations. This Act overrides any conflicting Hindu laws or customs, ensuring that Arya Samajists can marry without legal impediments. It applies to all citizens of Bangladesh, affirming the legitimacy of their marriages."
  },
  {
    "act_id": "173",
    "title": "The Muslim Personal Law (Shariat) Application Act, 1937",
    "year": "1937",
    "section_count": 6,
    "summary": "The Muslim Personal Law (Shariat) Application Act, 1937 establishes that Muslim Personal Law governs key personal matters for Muslims in Bangladesh, including marriage, maintenance, and inheritance. The Act allows Muslims to declare their intent to benefit from these laws and grants the government the authority to create rules for its implementation. It applies specifically to Muslims residing in Bangladesh, ensuring that their personal law is recognized and upheld."
  },
  {
    "act_id": "178",
    "title": "The Cutchi Memons Act, 1938",
    "year": "1938",
    "section_count": 3,
    "summary": "The Cutchi Memons Act, 1938, establishes that all Cutchi Memons in Bangladesh will be governed by Muslim Law regarding matters of succession and inheritance. It ensures that any rights or liabilities acquired before the Act came into effect remain unaffected, allowing ongoing legal proceedings related to those rights. This Act specifically applies to the Cutchi Memon community."
  },
  {
    "act_id": "180",
    "title": "The Dissolution of Muslim Marriages Act, 1939",
    "year": "1939",
    "section_count": 5,
    "summary": "The Dissolution of Muslim Marriages Act, 1939, provides a legal framework for Muslim women in Bangladesh to seek divorce under specific grounds related to their husband's conduct and circumstances. It outlines procedures for notifying the husband's heirs if he is missing, addresses the implications of a woman's conversion to another faith on her marriage, and ensures that her right to dower remains intact after divorce. This Act applies specifically to Muslim marriages in Bangladesh, safeguarding women's rights in the dissolution process."
  },
  {
    "act_id": "20",
    "title": "1The Divorce Act, 1869",
    "year": "1869",
    "section_count": 72,
    "summary": "The Divorce Act of 1869 governs the dissolution of marriages in Bangladesh, specifically for Christian couples. It outlines the grounds for divorce, the procedures for filing petitions, and the jurisdiction of courts, including the High Court Division. The Act applies to all individuals within Bangladesh who are subject to Christian marriage laws, detailing the rights and responsibilities of both husbands and wives in divorce proceedings."
  },
  {
    "act_id": "201",
    "title": "The Hindu Women's Rights to Property (Extension to Agricultural Land) Act, 1943 (Assam Act)",
    "year": "1943",
    "section_count": 2,
    "summary": "The Hindu Women's Rights to Property (Extension to Agricultural Land) Act, 1943, aims to extend the rights of Hindu women to include agricultural land as part of their property entitlements in the Sylhet district of Bangladesh. It clarifies that 'property' encompasses agricultural land and validates any property possession or transfers that occurred before the Act's implementation. This legislation specifically applies to Hindu women, enhancing their legal rights regarding property ownership."
  },
  {
    "act_id": "207",
    "title": "The Orphanages and Widows' Homes Act, 1944 (Bengal Act)",
    "year": "1944",
    "section_count": 11,
    "summary": "The Orphanages and Widows' Homes Act, 1944 regulates the establishment and operation of orphanages, widows' homes, and marriage bureaus in Bangladesh, requiring them to obtain licenses from the District Magistrate. It sets out definitions, inspection rights, penalties for non-compliance, and the jurisdiction for legal proceedings, while excluding certain institutions like government-maintained facilities. The Act aims to ensure proper oversight and standards for these social service organizations, protecting vulnerable populations such as orphans and widows."
  },
  {
    "act_id": "214",
    "title": "The Hindu Married Women's Right to Separate Residence and Maintenance Act, 1946",
    "year": "1946",
    "section_count": 3,
    "summary": "The Hindu Married Women's Right to Separate Residence and Maintenance Act, 1946, provides legal rights for Hindu married women in Bangladesh to seek separate living arrangements and financial support from their husbands under certain circumstances. It outlines the grounds for such claims, including misconduct by the husband, and establishes a framework for courts to determine the appropriate amount of maintenance based on the couple's social status and the husband's financial capacity. This act specifically applies to Hindu married women, ensuring their rights to dignity and support within the marital relationship."
  },
  {
    "act_id": "215",
    "title": "The Hindu Marriage Disabilities Removal Act, 1946",
    "year": "1946",
    "section_count": 2,
    "summary": "The Hindu Marriage Disabilities Removal Act, 1946 aims to eliminate restrictions on marriages among Hindus in Bangladesh, specifically addressing the validity of marriages between individuals from the same gotra or pravara, or from different sub-divisions of the same caste. This legislation ensures that such marriages are recognized as valid, promoting greater freedom in Hindu matrimonial choices. It applies to all Hindus in Bangladesh, facilitating their ability to marry without traditional caste-based limitations."
  },
  {
    "act_id": "25",
    "title": "1The Special Marriage Act, 1872",
    "year": "1872",
    "section_count": 27,
    "summary": "The Special Marriage Act, 1872, provides a legal framework for the solemnization of marriages in Bangladesh, allowing individuals of different religions or those who prefer a civil marriage to marry under its provisions. It outlines the necessary conditions for marriage, including age, consent, and residency requirements, and establishes procedures for marriage registration, objections, and the issuance of marriage certificates. This Act applies to all individuals wishing to marry in Bangladesh, regardless of their religious background, ensuring that marriages conducted under it are recognized legally."
  },
  {
    "act_id": "27",
    "title": "1The Christian Marriage Act, 1872",
    "year": "1872",
    "section_count": 105,
    "summary": "The Christian Marriage Act, 1872 governs the solemnization of marriages among Christian citizens in Bangladesh, ensuring that these marriages are conducted according to specific legal provisions. It outlines who is authorized to officiate marriages, the requirements for giving notice of intended marriages, and the procedures for marriage registration. The Act is applicable to all Christians in Bangladesh, providing a legal framework for their marital practices."
  },
  {
    "act_id": "290",
    "title": "The Claims for Maintenance (Recovery Abroad) Ordinance, 1959",
    "year": "1959",
    "section_count": 5,
    "summary": "The Claims for Maintenance (Recovery Abroad) Ordinance, 1959, aims to facilitate the recovery of maintenance claims for individuals residing in Bangladesh who are entitled to support from abroad. It outlines the legal framework for enforcing international conventions related to maintenance, defines key terms, and empowers the government to publish relevant information and create necessary rules. This ordinance applies to individuals seeking maintenance from foreign parties, ensuring that their rights are recognized and enforced in accordance with international agreements."
  },
  {
    "act_id": "30",
    "title": "1The Married Women's Property Act, 1874",
    "year": "1874",
    "section_count": 10,
    "summary": "The Married Women's Property Act, 1874, aims to protect the property rights of married women in Bangladesh by recognizing their earnings and assets as separate from their husbands. Key provisions include allowing women to own their earnings, take out insurance policies independently, and pursue legal action for their property. The Act applies to married women across Bangladesh, with certain religious exemptions, and clarifies the financial responsibilities and liabilities of both spouses regarding debts and property."
  },
  {
    "act_id": "305",
    "title": "The Muslim Family Laws Ordinance, 1961",
    "year": "1961",
    "section_count": 14,
    "summary": "The Muslim Family Laws Ordinance, 1961 regulates various aspects of family law for Muslim citizens in Bangladesh, focusing on marriage, divorce, inheritance, and maintenance. It establishes procedures for polygamy, talaq (divorce), and the rights of women, while also addressing the registration of marriages and the legal framework for dower and maintenance. This ordinance aims to provide a clear legal structure to ensure fairness and protect the rights of individuals within Muslim families."
  },
  {
    "act_id": "33",
    "title": "The Majority Act, 1875",
    "year": "1875",
    "section_count": 4,
    "summary": "The Majority Act, 1875 establishes the age of majority in Bangladesh, setting it at eighteen years for most individuals, while those under guardianship or court supervision reach majority at twenty-one. The Act applies to all individuals domiciled in Bangladesh and clarifies that personal capacities and religious practices are unaffected by its provisions. Overall, it provides a legal framework for determining when a person is considered an adult with full legal rights."
  },
  {
    "act_id": "470",
    "title": "The Children Act, 1974",
    "year": "1974",
    "section_count": 78,
    "summary": "The Children Act, 1974 aims to protect the rights and welfare of children in Bangladesh by establishing special legal provisions for their treatment in the justice system. It covers key topics such as the establishment of Juvenile Courts, the separate trial of children and adults, and the confidentiality of children's identities in legal proceedings. The Act applies to all children in conflict with the law, ensuring their cases are handled with care and consideration for their best interests."
  },
  {
    "act_id": "476",
    "title": "The Muslim Marriages and Divorces (Registration) Act, 1974",
    "year": "1974",
    "section_count": 18,
    "summary": "The Muslim Marriages and Divorces (Registration) Act, 1974 establishes a legal framework for the registration of marriages and divorces among Muslim citizens in Bangladesh. It mandates that all Muslim marriages must be registered, outlines the roles and responsibilities of licensed Nikah Registrars, and provides procedures for registering divorces. The Act applies to all Muslim individuals in Bangladesh, ensuring compliance with the registration process and safeguarding their marital rights."
  },
  {
    "act_id": "529",
    "title": "The Public Servants (Marriage with Foreign Nationals) Ordinance, 1976",
    "year": "1976",
    "section_count": 4,
    "summary": "The Public Servants (Marriage with Foreign Nationals) Ordinance, 1976 regulates the marriages of public servants in Bangladesh by requiring them to obtain permission from the President before marrying or promising to marry a foreign national. The ordinance defines key terms related to marriage and public service, and it nullifies any previous laws concerning such marriages. Its primary aim is to control and monitor the marital choices of public servants to prevent potential conflicts of interest."
  },
  {
    "act_id": "56",
    "title": "The Births, Deaths and Marriages Registration Act, 1886",
    "year": "1886",
    "section_count": 19,
    "summary": "The Births, Deaths and Marriages Registration Act, 1886 establishes a framework for the registration of vital events—specifically births, deaths, and marriages—across Bangladesh. It outlines the responsibilities of registry offices and officials, the process for maintaining and accessing vital records, and ensures that certified copies of these records are admissible as legal evidence. The Act applies to all residents of Bangladesh and aims to create a systematic approach to documenting these significant life events."
  },
  {
    "act_id": "607",
    "title": "The Dowry Prohibition Act, 1980",
    "year": "1980",
    "section_count": 9,
    "summary": "The Dowry Prohibition Act, 1980 aims to eliminate the practice of dowry in Bangladesh by making it illegal to give, take, or demand dowry in marriage. It defines dowry, imposes penalties for violations, and renders any agreements related to dowry void. The Act applies to all individuals involved in marriage, including the parents and guardians of brides and grooms, and establishes specific legal procedures for addressing related offences."
  },
  {
    "act_id": "621",
    "title": "The Bangladesh Abandoned Children (Special Provisions) (Repeal) Ordinacne, 1982",
    "year": "1982",
    "section_count": 2,
    "summary": "The Bangladesh Abandoned Children (Special Provisions) (Repeal) Ordinance, 1982, serves to officially repeal the Bangladesh Abandoned Children (Special Provisions) Order of 1972. Its main purpose is to eliminate the legal framework established for the care and management of abandoned children under the previous order. This ordinance applies to all matters related to abandoned children that were previously governed by the now-repealed order."
  },
  {
    "act_id": "64",
    "title": "The Guardians and Wards Act, 1890",
    "year": "1890",
    "section_count": 55,
    "summary": "The Guardians and Wards Act, 1890, establishes the legal framework for appointing guardians for minors in Bangladesh, focusing on their welfare and best interests. It outlines the procedures for applying for guardianship, the powers of the courts, and the qualifications for guardians, while specifying who can apply and the jurisdiction of the courts involved. This Act applies to all minors in Bangladesh and addresses both their personal and property guardianship needs."
  },
  {
    "act_id": "660",
    "title": "The Hindu Religious Welfare Trust Ordinance, 1983",
    "year": "1983",
    "section_count": 14,
    "summary": "The Hindu Religious Welfare Trust Ordinance, 1983 establishes a corporate body known as the Hindu Religious Welfare Trust to manage the religious welfare of the Hindu community in Bangladesh. It outlines the structure and functions of the Trust, including the appointment of a Board of Trustees, financial management, and reporting requirements. The Ordinance applies specifically to the Hindu community, ensuring their religious interests are supported and administered effectively."
  },
  {
    "act_id": "661",
    "title": "The Buddhist Religious Welfare Trust Ordinance, 1983",
    "year": "1983",
    "section_count": 14,
    "summary": "The Buddhist Religious Welfare Trust Ordinance, 1983 establishes a corporate body known as the Buddhist Religious Welfare Trust to promote the religious welfare of the Buddhist community in Bangladesh. It outlines the structure and governance of the Trust, including the roles of the Board of Trustees, financial management, and reporting requirements. The Ordinance applies to the Buddhist community and provides a framework for the Trust to manage its affairs and resources effectively."
  },
  {
    "act_id": "673",
    "title": "The Bangladesh Women's Rehabilitation and Welfare Foundation (Repeal) Ordinance, 1984",
    "year": "1984",
    "section_count": 2,
    "summary": "The Bangladesh Women's Rehabilitation and Welfare Foundation (Repeal) Ordinance, 1984, primarily serves to dissolve the Bangladesh Women's Rehabilitation and Welfare Foundation established in 1974. It transfers all assets and liabilities of the Foundation to the Government, effectively ending its operations. This ordinance applies to the Foundation and its stakeholders, ensuring that any responsibilities previously held by the Foundation are now managed by the Government."
  },
  {
    "act_id": "68",
    "title": "The Partition Act, 1893",
    "year": "1893",
    "section_count": 10,
    "summary": "The Partition Act, 1893 governs the division of immovable property among co-owners in Bangladesh, allowing courts to order the sale of property instead of dividing it when division is impractical. It outlines procedures for shareholders to buy shares, addresses the rights of family members in dwelling-house partitions, and provides guidelines for sales and bidding processes. This act applies to all individuals involved in partition suits concerning shared property, including those with disabilities and non-family members."
  },
  {
    "act_id": "682",
    "title": "The Family Courts Ordinance, 1985",
    "year": "1985",
    "section_count": 28,
    "summary": "The Family Courts Ordinance, 1985 establishes a specialized legal framework for resolving family-related disputes in Bangladesh, including matters of marriage, maintenance, and child custody. It sets up Family Courts with exclusive jurisdiction over these issues, outlining procedures for filing suits, conducting trials, and enforcing judgments. This Ordinance applies to all individuals involved in family law matters within Bangladesh, ensuring a focused and efficient approach to family disputes."
  },
  {
    "act_id": "749",
    "title": "জাতীয় মহিলা সংস্থা আইন, ১৯৯১",
    "year": "১৯৯১",
    "section_count": 28,
    "summary": "The National Women's Agency Act, 1991 establishes a government organization in Bangladesh aimed at promoting women's rights and empowerment through various initiatives, including vocational training and legal support. It outlines the structure, management, and operational procedures of the organization, including the formation of district and sub-district committees to carry out its activities. The act applies to all entities involved in women's development and ensures accountability through reporting and auditing requirements."
  },
  {
    "act_id": "83",
    "title": "The Foreign Marriage Act, 1903",
    "year": "1903",
    "section_count": 2,
    "summary": "The Foreign Marriage Act, 1903 governs the process for Bangladeshi citizens and government personnel wishing to marry abroad. It establishes the necessary procedures for giving notice of an intended marriage, ensuring that such marriages are properly registered and recognized. The Act applies to all citizens of Bangladesh and includes provisions for the role of the Marriage Registrar or District Magistrate in facilitating these marriages."
  },
  {
    "act_id": "835",
    "title": "নারী ও শিশু নির্যাতন দমন আইন, ২০০০",
    "year": "২০০০",
    "section_count": 43,
    "summary": "The Women and Children Repression Prevention Act, 2000 aims to protect women and children from various forms of violence and abuse, including sexual offenses, abduction, and dowry-related crimes. It establishes strict penalties for perpetrators, including life imprisonment and the death penalty, while also addressing the rights of victims and the confidentiality of their identities. This law applies to all individuals in Bangladesh, ensuring legal recourse for victims of such crimes."
  },
  {
    "act_id": "9",
    "title": "The Hindu Widow's Re-marriage Act, 1856",
    "year": "1856",
    "section_count": 10,
    "summary": "The Hindu Widow's Re-marriage Act, 1856, legalizes the remarriage of Hindu widows, ensuring that such marriages are valid regardless of the widow's previous marital status. The act addresses important issues such as the cessation of property rights upon remarriage, the guardianship of children from the deceased husband, and the requirements for consent in the case of minor widows. It applies specifically to Hindu widows in Bangladesh, providing them with rights and protections related to remarriage and inheritance."
  },
  {
    "act_id": "92",
    "title": "The Anand Marriage Act, 1909",
    "year": "1909",
    "section_count": 5,
    "summary": "The Anand Marriage Act, 1909, establishes the legal validity of marriages solemnized according to the Sikh Anand ceremony throughout Bangladesh. It specifically applies to Sikh individuals, confirming that such marriages are recognized by law while exempting those not adhering to Sikhism and ensuring that marriages within prohibited degrees of relation remain invalid. The Act also clarifies that marriages conducted under other Sikh customs are still legally recognized."
  },
  {
    "act_id": "921",
    "title": "জন্ম ও মৃত্যু নিবন্ধন আইন, ২০০৪",
    "year": "২০০৪",
    "section_count": 26,
    "summary": "The Birth and Death Registration Act, 2004 establishes a legal framework for the registration of births and deaths in Bangladesh, ensuring that all individuals, regardless of nationality, religion, or gender, can have their vital events officially recorded. It outlines the responsibilities of registrars, the process for obtaining birth and death certificates, and the procedures for correcting or canceling these records. The act applies to all residents of Bangladesh and mandates timely registration to maintain accurate public records."
  },
  {
    "act_id": "956",
    "title": "কারাগারে আটক সাজাপ্রাপ্ত নারীদের বিশেষ সুবিধা আইন, ২০০৬",
    "year": "২০০৬",
    "section_count": 18,
    "summary": "The Special Provisions for Women Prisoners Act, 2006 aims to provide specific benefits and support for women prisoners in Bangladesh, including conditional release, vocational training, and rehabilitation services. It establishes a framework for eligibility and ineligibility for these benefits, outlines the roles of national and district committees in administering them, and sets procedures for applying and reviewing special privileges. The act applies primarily to female prisoners who have served a significant portion of their sentences, while excluding those convicted of serious offenses like treason."
  }
]